GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18lf27k42.inc
;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC2            EQU  H'0002'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA3           EQU  H'0003'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'
TRISA6           EQU  H'0006'
TRISA7           EQU  H'0007'


;----- TRISB Bits -----------------------------------------------------
TRISB0           EQU  H'0000'
TRISB1           EQU  H'0001'
TRISB2           EQU  H'0002'
TRISB3           EQU  H'0003'
TRISB4           EQU  H'0004'
TRISB5           EQU  H'0005'
TRISB6           EQU  H'0006'
TRISB7           EQU  H'0007'


;----- TRISC Bits -----------------------------------------------------
TRISC0           EQU  H'0000'
TRISC1           EQU  H'0001'
TRISC2           EQU  H'0002'
TRISC3           EQU  H'0003'
TRISC4           EQU  H'0004'
TRISC5           EQU  H'0005'
TRISC6           EQU  H'0006'
TRISC7           EQU  H'0007'


;----- PORTA Bits -----------------------------------------------------
RA0              EQU  H'0000'
RA1              EQU  H'0001'
RA2              EQU  H'0002'
RA3              EQU  H'0003'
RA4              EQU  H'0004'
RA5              EQU  H'0005'
RA6              EQU  H'0006'
RA7              EQU  H'0007'


;----- PORTB Bits -----------------------------------------------------
RB0              EQU  H'0000'
RB1              EQU  H'0001'
RB2              EQU  H'0002'
RB3              EQU  H'0003'
RB4              EQU  H'0004'
RB5              EQU  H'0005'
RB6              EQU  H'0006'
RB7              EQU  H'0007'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC2              EQU  H'0002'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'


;----- PORTE Bits -----------------------------------------------------
RE3              EQU  H'0003'


;----- INTCON0 Bits -----------------------------------------------------
INT0EDG          EQU  H'0000'
INT1EDG          EQU  H'0001'
INT2EDG          EQU  H'0002'
IPEN_INTCON0     EQU  H'0005'
GIEL             EQU  H'0006'
GIE              EQU  H'0007'

GIEH             EQU  H'0007'


;----- INTCON1 Bits -----------------------------------------------------
STAT0_INTCON1    EQU  H'0006'
STAT1_INTCON1    EQU  H'0007'


;----- IVTLOCK Bits -----------------------------------------------------
IVTLOCKED        EQU  H'0000'


;----- IVTBASEL Bits -----------------------------------------------------
BASE0            EQU  H'0000'
BASE1            EQU  H'0001'
BASE2            EQU  H'0002'
BASE3            EQU  H'0003'
BASE4            EQU  H'0004'
BASE5            EQU  H'0005'
BASE6            EQU  H'0006'
BASE7            EQU  H'0007'


;----- IVTBASEH Bits -----------------------------------------------------
BASE8            EQU  H'0000'
BASE9            EQU  H'0001'
BASE10           EQU  H'0002'
BASE11           EQU  H'0003'
BASE12           EQU  H'0004'
BASE13           EQU  H'0005'
BASE14           EQU  H'0006'
BASE15           EQU  H'0007'


;----- IVTBASEU Bits -----------------------------------------------------
BASE16           EQU  H'0000'
BASE17           EQU  H'0001'
BASE18           EQU  H'0002'
BASE19           EQU  H'0003'
BASE20           EQU  H'0004'


;----- STATUS Bits -----------------------------------------------------
C                EQU  H'0000'
DC               EQU  H'0001'
Z                EQU  H'0002'
OV_STATUS        EQU  H'0003'
N                EQU  H'0004'
NOT_PD           EQU  H'0005'
NOT_TO           EQU  H'0006'

PD               EQU  H'0005'
TO               EQU  H'0006'


;----- PCON0 Bits -----------------------------------------------------
NOT_BOR          EQU  H'0000'
NOT_POR          EQU  H'0001'
NOT_RI           EQU  H'0002'
NOT_RMCLR        EQU  H'0003'
NOT_RWDT         EQU  H'0004'
NOT_WDTWV        EQU  H'0005'
STKUNF           EQU  H'0006'
STKOVF           EQU  H'0007'

BOR              EQU  H'0000'
POR              EQU  H'0001'
RI               EQU  H'0002'
RMCLR            EQU  H'0003'
RWDT             EQU  H'0004'
WDTWV            EQU  H'0005'


;----- PCON1 Bits -----------------------------------------------------
NOT_MEMV         EQU  H'0001'

MEMV             EQU  H'0001'


;----- STKPTR Bits -----------------------------------------------------
STKPTR0          EQU  H'0000'
STKPTR1          EQU  H'0001'
STKPTR2          EQU  H'0002'
STKPTR3          EQU  H'0003'
STKPTR4          EQU  H'0004'

SP0              EQU  H'0000'
SP1              EQU  H'0001'
SP2              EQU  H'0002'
SP3              EQU  H'0003'
SP4              EQU  H'0004'



;==========================================================================
;
;       RAM Definitions
;
;==========================================================================
       __MAXRAM  H'3FFF'
       __BADRAM  H'2000'-H'37FF'
       __BADRAM  H'3800'-H'387F'
       __BADRAM  H'3891'-H'389C'
       __BADRAM  H'38A0'-H'395A'
       __BADRAM  H'396A'-H'3975'
       __BADRAM  H'397E'-H'397F'
       __BADRAM  H'398B'-H'398F'
       __BADRAM  H'399B'-H'399F'
       __BADRAM  H'39AB'-H'39BF'
       __BADRAM  H'39C8'-H'39CF'
       __BADRAM  H'39D1'-H'39D7'
       __BADRAM  H'39E2'
       __BADRAM  H'39E4'
       __BADRAM  H'39E7'-H'39EE'
       __BADRAM  H'39F0'
       __BADRAM  H'39F5'-H'39F6'
       __BADRAM  H'39F8'-H'39FF'
       __BADRAM  H'3A18'-H'3A3F'
       __BADRAM  H'3A48'-H'3A4F'
       __BADRAM  H'3A58'-H'3A59'
       __BADRAM  H'3A5C'-H'3A5F'
       __BADRAM  H'3A68'-H'3A69'
       __BADRAM  H'3A6C'-H'3A80'
       __BADRAM  H'3A82'-H'3A83'
       __BADRAM  H'3A88'-H'3ABE'
       __BADRAM  H'3AE7'
       __BADRAM  H'3AEA'-H'3BC8'
       __BADRAM  H'3BE0'-H'3BE8'
       __BADRAM  H'3C00'-H'3C55'
       __BADRAM  H'3C7F'-H'3CE4'
       __BADRAM  H'3CE7'-H'3CF9'
       __BADRAM  H'3CFF'-H'3D0F'
       __BADRAM  H'3D1D'-H'3D53'
       __BADRAM  H'3D67'-H'3D69'
       __BADRAM  H'3D7D'-H'3DCF'
       __BADRAM  H'3DD1'
       __BADRAM  H'3DD3'
       __BADRAM  H'3DD5'
       __BADRAM  H'3DD7'
       __BADRAM  H'3DD9'
       __BADRAM  H'3DE3'-H'3DE7'
       __BADRAM  H'3DFB'-H'3E9B'
       __BADRAM  H'3E9D'
       __BADRAM  H'3E9F'-H'3EB7'
       __BADRAM  H'3EC2'
       __BADRAM  H'3EC4'-H'3EC8'
       __BADRAM  H'3ECB'-H'3ED6'
       __BADRAM  H'3ED8'-H'3EDD'
       __BADRAM  H'3EF2'
       __BADRAM  H'3F00'-H'3F11'
       __BADRAM  H'3F24'-H'3F37'
       __BADRAM  H'3F5B'-H'3F5D'
       __BADRAM  H'3F63'
       __BADRAM  H'3F67'
       __BADRAM  H'3F6B'
       __BADRAM  H'3F6F'
       __BADRAM  H'3F80'-H'3F91'
       __BADRAM  H'3FBD'-H'3FC1'
       __BADRAM  H'3FC5'-H'3FC9'
       __BADRAM  H'3FCD'
       __BADRAM  H'3FCF'-H'3FD1'
       __BADRAM  H'3FF2'

